INSERT INTO sr_codes (territory_id, category_id, code)
SELECT
    t.id,
    bc.id,
    v.code
FROM (
         VALUES
             ('Розница 1', 'Бренд Мултон', 'SAM-1'),
             ('Розница 1', 'Бренд Эрман/Кампина', 'SAE-1'),
             ('Розница 1', 'Бренд Махеев', 'SAMah-1'),
             ('Розница 1', 'Бренд Мултон', 'SAM-7'),
             ('Розница 1', 'Бренд Эрман/Кампина', 'SAE-7'),
             ('Розница 1', 'Бренд Махеев', 'SAMah-7'),

             ('Розница 2', 'Бренд Мултон', 'SAM-2'),
             ('Розница 2', 'Бренд Эрман/Кампина', 'SAE-2'),
             ('Розница 2', 'Бренд Махеев', 'SAMah-2'),
             ('Розница 2', 'Бренд Мултон', 'SAM-4'),
             ('Розница 2', 'Бренд Эрман/Кампина', 'SAE-4'),
             ('Розница 2', 'Бренд Махеев', 'SAMah-4'),

             ('Розница 3', 'Бренд Мултон', 'SAM-6'),
             ('Розница 3', 'Бренд Эрман/Кампина', 'SAE-6'),
             ('Розница 3', 'Бренд Махеев', 'SAMah-6'),
             ('Розница 3', 'Бренд Мултон', 'SAM-8'),
             ('Розница 3', 'Бренд Эрман/Кампина', 'SAE-8'),
             ('Розница 3', 'Бренд Махеев', 'SAMah-8'),

             ('Розница 4', 'Бренд Мултон', 'SAM-3'),
             ('Розница 4', 'Бренд Эрман/Кампина', 'SAE-3'),
             ('Розница 4', 'Бренд Махеев', 'SAMah-3'),
             ('Розница 4', 'Бренд Мултон', 'SAM-5'),
             ('Розница 4', 'Бренд Эрман/Кампина', 'SAE-5'),
             ('Розница 4', 'Бренд Махеев', 'SAMah-5'),

             ('Гиссар', 'Бренд Мултон', 'SADG1'),
             ('Гиссар', 'Бренд Эрман/Кампина', 'SADG2'),
             ('Гиссар', 'Бренд Махеев', 'SADG3'),

             ('Турсунзаде', 'Бренд Мултон', 'SADT1'),
             ('Турсунзаде', 'Бренд Эрман/Кампина', 'SADT2'),
             ('Турсунзаде', 'Бренд Махеев', 'SADT3'),

             ('Рудаки', 'Бренд Мултон', 'SADR1'),
             ('Рудаки', 'Бренд Эрман/Кампина', 'SADR2'),
             ('Рудаки', 'Бренд Махеев', 'SADR3'),

             ('Вахдат', 'Бренд Мултон', 'SADV1'),
             ('Вахдат', 'Бренд Эрман/Кампина', 'SADV2'),
             ('Вахдат', 'Бренд Махеев', 'SADV3'),

             ('СМ', 'Микс Мултон/Махеев', 'SASM-1'),
             ('СМ', 'Микс Мултон/Махеев', 'SASM-2'),
             ('СМ', 'Микс Мултон/Махеев', 'SASM-3'),
             ('СМ', 'Бренд Эрман/Кампина', 'SASM-4'),
             ('СМ', 'Бренд Эрман/Кампина', 'SASM-5'),
             ('СМ', 'Бренд Эрман/Кампина', 'SASM-6'),

             ('ХорекаДи', 'Микс ХорекаДи', 'SAHO-1'),
             ('ХорекаДи', 'Микс ХорекаДи', 'SAHO-2'),
             ('ХорекаДи', 'Микс ХорекаДи', 'SAHO-3'),
             ('ХорекаДи', 'Микс ХорекаДи', 'SAHO-4'),

             ('Оптовики Фаровон', 'Бренд Мултон', 'SADF1'),
             ('Оптовики Фаровон', 'Бренд Эрман/Кампина', 'SADF2'),
             ('Оптовики Фаровон', 'Бренд Мултон', 'SADFT1'),
             ('Оптовики Фаровон', 'Бренд Эрман/Кампина', 'SADFT2'),
             ('Оптовики Фаровон', 'Бренд Махеев', 'SADFT3')
     ) AS v(territory_name, category_name, code)
         JOIN territories t
              ON t.name = v.territory_name
         JOIN brand_categories bc
              ON bc.name = v.category_name
    ON CONFLICT (code) DO NOTHING;